MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK65FN2M0VMI18/mcu.h
#define USBHS_OTGSC_DPIS_MASK                    (0x400000U)
#define USBHS_OTGSC_DPIS_SHIFT                   (22U)
/*! DPIS - Data Pulse interrupt Status
 */
#define USBHS_OTGSC_DPIS(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_OTGSC_DPIS_SHIFT)) & USBHS_OTGSC_DPIS_MASK)

#define USBHS_OTGSC_IDIE_MASK                    (0x1000000U)
#define USBHS_OTGSC_IDIE_SHIFT                   (24U)
/*! IDIE - USB ID Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define USBHS_OTGSC_IDIE(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_OTGSC_IDIE_SHIFT)) & USBHS_OTGSC_IDIE_MASK)

#define USBHS_OTGSC_AVVIE_MASK                   (0x2000000U)
#define USBHS_OTGSC_AVVIE_SHIFT                  (25U)
/*! AVVIE - A VBUS Valid Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define USBHS_OTGSC_AVVIE(x)                     (((uint32_t)(((uint32_t)(x)) << USBHS_OTGSC_AVVIE_SHIFT)) & USBHS_OTGSC_AVVIE_MASK)

#define USBHS_OTGSC_ASVIE_MASK                   (0x4000000U)
#define USBHS_OTGSC_ASVIE_SHIFT                  (26U)
/*! ASVIE - A Session Valid Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define USBHS_OTGSC_ASVIE(x)                     (((uint32_t)(((uint32_t)(x)) << USBHS_OTGSC_ASVIE_SHIFT)) & USBHS_OTGSC_ASVIE_MASK)

#define USBHS_OTGSC_BSVIE_MASK                   (0x8000000U)
#define USBHS_OTGSC_BSVIE_SHIFT                  (27U)
/*! BSVIE - B Session Valid Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define USBHS_OTGSC_BSVIE(x)                     (((uint32_t)(((uint32_t)(x)) << USBHS_OTGSC_BSVIE_SHIFT)) & USBHS_OTGSC_BSVIE_MASK)

#define USBHS_OTGSC_BSEIE_MASK                   (0x10000000U)
#define USBHS_OTGSC_BSEIE_SHIFT                  (28U)
/*! BSEIE - B Session End Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define USBHS_OTGSC_BSEIE(x)                     (((uint32_t)(((uint32_t)(x)) << USBHS_OTGSC_BSEIE_SHIFT)) & USBHS_OTGSC_BSEIE_MASK)

#define USBHS_OTGSC_MSE_MASK                     (0x20000000U)
#define USBHS_OTGSC_MSE_SHIFT                    (29U)
/*! MSE - 1 Milli-Second timer interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define USBHS_OTGSC_MSE(x)                       (((uint32_t)(((uint32_t)(x)) << USBHS_OTGSC_MSE_SHIFT)) & USBHS_OTGSC_MSE_MASK)

#define USBHS_OTGSC_DPIE_MASK                    (0x40000000U)
#define USBHS_OTGSC_DPIE_SHIFT                   (30U)
/*! DPIE - Data Pulse Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define USBHS_OTGSC_DPIE(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_OTGSC_DPIE_SHIFT)) & USBHS_OTGSC_DPIE_MASK)
/*! @} */

/*! @name USBMODE - USB Mode Register */
/*! @{ */

#define USBHS_USBMODE_CM_MASK                    (0x3U)
#define USBHS_USBMODE_CM_SHIFT                   (0U)
/*! CM - Controller Mode
 *  0b00..Idle (default for the USBHS module)
 *  0b01..Reserved
 *  0b10..Device controller
 *  0b11..Host controller
 */
#define USBHS_USBMODE_CM(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_USBMODE_CM_SHIFT)) & USBHS_USBMODE_CM_MASK)

#define USBHS_USBMODE_ES_MASK                    (0x4U)
#define USBHS_USBMODE_ES_SHIFT                   (2U)
/*! ES - Endian Select
 *  0b0..Little endian. First byte referenced in least significant byte of 32-bit word.
 *  0b1..Big endian. First byte referenced in most significant byte of 32-bit word.
 */
#define USBHS_USBMODE_ES(x)                      (((uint32_t)(((uint32_t)(x)) << USBHS_USBMODE_ES_SHIFT)) & USBHS_USBMODE_ES_MASK)

#define USBHS_USBMODE_SLOM_MASK                  (0x8U)
#define USBHS_USBMODE_SLOM_SHIFT                 (3U)
/*! SLOM - Setup Lock-Out Mode
 */
#define USBHS_USBMODE_SLOM(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_USBMODE_SLOM_SHIFT)) & USBHS_USBMODE_SLOM_MASK)

#define USBHS_USBMODE_SDIS_MASK                  (0x10U)
#define USBHS_USBMODE_SDIS_SHIFT                 (4U)
/*! SDIS - Stream DISable
 *  0b0..Inactive
 *  0b1..Active
 */
#define USBHS_USBMODE_SDIS(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_USBMODE_SDIS_SHIFT)) & USBHS_USBMODE_SDIS_MASK)

#define USBHS_USBMODE_TXHSD_MASK                 (0x7000U)
#define USBHS_USBMODE_TXHSD_SHIFT                (12U)
/*! TXHSD - Tx to Tx HS Delay
 *  0b000..10
 *  0b001..11
 *  0b010..12
 *  0b011..13
 *  0b100..14
 *  0b101..15
 *  0b110..16
 *  0b111..17
 */
#define USBHS_USBMODE_TXHSD(x)                   (((uint32_t)(((uint32_t)(x)) << USBHS_USBMODE_TXHSD_SHIFT)) & USBHS_USBMODE_TXHSD_MASK)
/*! @} */

/*! @name EPSETUPSR - Endpoint Setup Status Register */
/*! @{ */

#define USBHS_EPSETUPSR_EPSETUPSTAT_MASK         (0xFU)
#define USBHS_EPSETUPSR_EPSETUPSTAT_SHIFT        (0U)
/*! EPSETUPSTAT - Setup Endpoint Status
 */
#define USBHS_EPSETUPSR_EPSETUPSTAT(x)           (((uint32_t)(((uint32_t)(x)) << USBHS_EPSETUPSR_EPSETUPSTAT_SHIFT)) & USBHS_EPSETUPSR_EPSETUPSTAT_MASK)
/*! @} */

/*! @name EPPRIME - Endpoint Initialization Register */
/*! @{ */

#define USBHS_EPPRIME_PERB_MASK                  (0xFU)
#define USBHS_EPPRIME_PERB_SHIFT                 (0U)
/*! PERB - Prime Endpoint Receive Buffer
 */
#define USBHS_EPPRIME_PERB(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_EPPRIME_PERB_SHIFT)) & USBHS_EPPRIME_PERB_MASK)

#define USBHS_EPPRIME_PETB_MASK                  (0xF0000U)
#define USBHS_EPPRIME_PETB_SHIFT                 (16U)
/*! PETB - Prime Endpoint tTansmit Buffer
 */
#define USBHS_EPPRIME_PETB(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_EPPRIME_PETB_SHIFT)) & USBHS_EPPRIME_PETB_MASK)
/*! @} */

/*! @name EPFLUSH - Endpoint Flush Register */
/*! @{ */

#define USBHS_EPFLUSH_FERB_MASK                  (0xFU)
#define USBHS_EPFLUSH_FERB_SHIFT                 (0U)
/*! FERB - Flush Endpoint Receive Buffer
 */
#define USBHS_EPFLUSH_FERB(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_EPFLUSH_FERB_SHIFT)) & USBHS_EPFLUSH_FERB_MASK)

#define USBHS_EPFLUSH_FETB_MASK                  (0xF0000U)
#define USBHS_EPFLUSH_FETB_SHIFT                 (16U)
/*! FETB - Flush Endpoint Transmit Buffer
 */
#define USBHS_EPFLUSH_FETB(x)                    (((uint32_t)(((uint32_t)(x)) << USBHS_EPFLUSH_FETB_SHIFT)) & USBHS_EPFLUSH_FETB_MASK)
/*! @} */

/*! @name EPSR - Endpoint Status Register */
/*! @{ */

#define USBHS_EPSR_ERBR_MASK                     (0xFU)
#define USBHS_EPSR_ERBR_SHIFT                    (0U)
/*! ERBR - Endpoint Receive Buffer Ready
 */
#define USBHS_EPSR_ERBR(x)                       (((uint32_t)(((uint32_t)(x)) << USBHS_EPSR_ERBR_SHIFT)) & USBHS_EPSR_ERBR_MASK)

#define USBHS_EPSR_ETBR_MASK                     (0xF0000U)
#define USBHS_EPSR_ETBR_SHIFT                    (16U)
/*! ETBR - Endpoint Transmit Buffer Ready
 */
#define USBHS_EPSR_ETBR(x)                       (((uint32_t)(((uint32_t)(x)) << USBHS_EPSR_ETBR_SHIFT)) & USBHS_EPSR_ETBR_MASK)
/*! @} */

/*! @name EPCOMPLETE - Endpoint Complete Register */
/*! @{ */

#define USBHS_EPCOMPLETE_ERCE_MASK               (0xFU)
#define USBHS_EPCOMPLETE_ERCE_SHIFT              (0U)
/*! ERCE - Endpoint Receive Complete Event
 */
#define USBHS_EPCOMPLETE_ERCE(x)                 (((uint32_t)(((uint32_t)(x)) << USBHS_EPCOMPLETE_ERCE_SHIFT)) & USBHS_EPCOMPLETE_ERCE_MASK)

#define USBHS_EPCOMPLETE_ETCE_MASK               (0xF0000U)
#define USBHS_EPCOMPLETE_ETCE_SHIFT              (16U)
/*! ETCE - Endpoint Transmit Complete Event
 */
#define USBHS_EPCOMPLETE_ETCE(x)                 (((uint32_t)(((uint32_t)(x)) << USBHS_EPCOMPLETE_ETCE_SHIFT)) & USBHS_EPCOMPLETE_ETCE_MASK)
/*! @} */

/*! @name EPCR0 - Endpoint Control Register 0 */
/*! @{ */

