MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK65FN2M0VMI18/mcu.h
#define USBHS_EPCR0_RXS_MASK                     (0x1U)
#define USBHS_EPCR0_RXS_SHIFT                    (0U)
/*! RXS - RX endpoint Stall
 *  0b0..Endpoint OK
 *  0b1..Endpoint stalled
 */
#define USBHS_EPCR0_RXS(x)                       (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR0_RXS_SHIFT)) & USBHS_EPCR0_RXS_MASK)

#define USBHS_EPCR0_RXT_MASK                     (0xCU)
#define USBHS_EPCR0_RXT_SHIFT                    (2U)
/*! RXT - RX endpoint Type
 *  0b00..Control
 */
#define USBHS_EPCR0_RXT(x)                       (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR0_RXT_SHIFT)) & USBHS_EPCR0_RXT_MASK)

#define USBHS_EPCR0_RXE_MASK                     (0x80U)
#define USBHS_EPCR0_RXE_SHIFT                    (7U)
/*! RXE - RX endpoint Enable
 *  0b1..Enabled
 */
#define USBHS_EPCR0_RXE(x)                       (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR0_RXE_SHIFT)) & USBHS_EPCR0_RXE_MASK)

#define USBHS_EPCR0_TXS_MASK                     (0x10000U)
#define USBHS_EPCR0_TXS_SHIFT                    (16U)
/*! TXS - TX Endpoint Stall
 *  0b0..Endpoint OK
 *  0b1..Endpoint stalled
 */
#define USBHS_EPCR0_TXS(x)                       (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR0_TXS_SHIFT)) & USBHS_EPCR0_TXS_MASK)

#define USBHS_EPCR0_TXT_MASK                     (0xC0000U)
#define USBHS_EPCR0_TXT_SHIFT                    (18U)
/*! TXT - TX Endpoint Type
 *  0b00..Control
 */
#define USBHS_EPCR0_TXT(x)                       (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR0_TXT_SHIFT)) & USBHS_EPCR0_TXT_MASK)

#define USBHS_EPCR0_TXE_MASK                     (0x800000U)
#define USBHS_EPCR0_TXE_SHIFT                    (23U)
/*! TXE - TX Endpoint Enable
 *  0b1..Enable
 */
#define USBHS_EPCR0_TXE(x)                       (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR0_TXE_SHIFT)) & USBHS_EPCR0_TXE_MASK)
/*! @} */

/*! @name EPCR - Endpoint Control Register n */
/*! @{ */

#define USBHS_EPCR_RXS_MASK                      (0x1U)
#define USBHS_EPCR_RXS_SHIFT                     (0U)
/*! RXS - RX endpoint Stall
 *  0b0..Endpoint OK
 *  0b1..Endpoint stalled
 */
#define USBHS_EPCR_RXS(x)                        (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR_RXS_SHIFT)) & USBHS_EPCR_RXS_MASK)

#define USBHS_EPCR_RXD_MASK                      (0x2U)
#define USBHS_EPCR_RXD_SHIFT                     (1U)
/*! RXD - RX endpoint Data sink
 */
#define USBHS_EPCR_RXD(x)                        (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR_RXD_SHIFT)) & USBHS_EPCR_RXD_MASK)

#define USBHS_EPCR_RXT_MASK                      (0xCU)
#define USBHS_EPCR_RXT_SHIFT                     (2U)
/*! RXT - RX endpoint Type
 *  0b00..Control
 *  0b01..Isochronous
 *  0b10..Bulk
 *  0b11..Interrupt
 */
#define USBHS_EPCR_RXT(x)                        (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR_RXT_SHIFT)) & USBHS_EPCR_RXT_MASK)

#define USBHS_EPCR_RXI_MASK                      (0x20U)
#define USBHS_EPCR_RXI_SHIFT                     (5U)
/*! RXI - RX data toggle Inhibit
 *  0b0..PID sequencing enabled
 *  0b1..PID sequencing disabled
 */
#define USBHS_EPCR_RXI(x)                        (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR_RXI_SHIFT)) & USBHS_EPCR_RXI_MASK)

#define USBHS_EPCR_RXR_MASK                      (0x40U)
#define USBHS_EPCR_RXR_SHIFT                     (6U)
/*! RXR - RX data toggle Reset
 */
#define USBHS_EPCR_RXR(x)                        (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR_RXR_SHIFT)) & USBHS_EPCR_RXR_MASK)

#define USBHS_EPCR_RXE_MASK                      (0x80U)
#define USBHS_EPCR_RXE_SHIFT                     (7U)
/*! RXE - RX endpoint Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define USBHS_EPCR_RXE(x)                        (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR_RXE_SHIFT)) & USBHS_EPCR_RXE_MASK)

#define USBHS_EPCR_TXS_MASK                      (0x10000U)
#define USBHS_EPCR_TXS_SHIFT                     (16U)
/*! TXS - TX endpoint Stall
 *  0b0..Endpoint OK
 *  0b1..Endpoint stalled
 */
#define USBHS_EPCR_TXS(x)                        (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR_TXS_SHIFT)) & USBHS_EPCR_TXS_MASK)

#define USBHS_EPCR_TXD_MASK                      (0x20000U)
#define USBHS_EPCR_TXD_SHIFT                     (17U)
/*! TXD - TX endpoint Data source
 */
#define USBHS_EPCR_TXD(x)                        (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR_TXD_SHIFT)) & USBHS_EPCR_TXD_MASK)

#define USBHS_EPCR_TXT_MASK                      (0xC0000U)
#define USBHS_EPCR_TXT_SHIFT                     (18U)
/*! TXT - TX endpoint Type
 *  0b00..Control
 *  0b01..Isochronous
 *  0b10..Bulk
 *  0b11..Interrupt
 */
#define USBHS_EPCR_TXT(x)                        (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR_TXT_SHIFT)) & USBHS_EPCR_TXT_MASK)

#define USBHS_EPCR_TXI_MASK                      (0x200000U)
#define USBHS_EPCR_TXI_SHIFT                     (21U)
/*! TXI - TX data toggle Inhibit
 *  0b0..PID sequencing enabled
 *  0b1..PID sequencing disabled
 */
#define USBHS_EPCR_TXI(x)                        (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR_TXI_SHIFT)) & USBHS_EPCR_TXI_MASK)

#define USBHS_EPCR_TXR_MASK                      (0x400000U)
#define USBHS_EPCR_TXR_SHIFT                     (22U)
/*! TXR - TX data toggle Reset
 */
#define USBHS_EPCR_TXR(x)                        (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR_TXR_SHIFT)) & USBHS_EPCR_TXR_MASK)

#define USBHS_EPCR_TXE_MASK                      (0x800000U)
#define USBHS_EPCR_TXE_SHIFT                     (23U)
/*! TXE - TX endpoint Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define USBHS_EPCR_TXE(x)                        (((uint32_t)(((uint32_t)(x)) << USBHS_EPCR_TXE_SHIFT)) & USBHS_EPCR_TXE_MASK)
/*! @} */

/* The count of USBHS_EPCR */
#define USBHS_EPCR_COUNT                         (7U)

/*! @name USBGENCTRL - USB General Control Register */
/*! @{ */

#define USBHS_USBGENCTRL_WU_IE_MASK              (0x1U)
#define USBHS_USBGENCTRL_WU_IE_SHIFT             (0U)
/*! WU_IE - Wakeup Interrupt Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define USBHS_USBGENCTRL_WU_IE(x)                (((uint32_t)(((uint32_t)(x)) << USBHS_USBGENCTRL_WU_IE_SHIFT)) & USBHS_USBGENCTRL_WU_IE_MASK)

